[
  {
    "timestamp": "2023-12-21T17:04:35.910Z",
    "joke": "My Iraqi friend skyped me today Something hilarious must've been happening because I kept hearing \"Hahahahallahu hahahkbar\" and then what sounded like party poppers. Abdul sure is a mad one.",
    "smileDegree": 1
  },
  {
    "timestamp": "2023-12-21T17:04:44.009Z",
    "joke": "What do you get when you cross a fag and a dairy farm? A Dairy Queen",
    "smileDegree": 0.36956849377129275
  },
  {
    "timestamp": "2023-12-21T17:04:51.196Z",
    "joke": "I'd tell you the joke about the pirate But I don't think its arrrrrrpropriate.",
    "smileDegree": 0.002717921343195738
  },
  {
    "timestamp": "2023-12-21T17:05:03.480Z",
    "joke": "officer it's my son's car \"just make it stop sir\" I don't know how \"can you call him\" I'll try *tries to dial while car bounces up and down*",
    "smileDegree": 0.9126400797128373
  },
  {
    "timestamp": "2023-12-21T17:05:07.307Z",
    "joke": "Never heard this joke before... neither will you",
    "smileDegree": 0.0016847078653594247
  },
  {
    "timestamp": "2023-12-21T17:05:23.136Z",
    "joke": "Thinking of starting a website that auto-tweets when you j/o. \"I'm the mayor of MY GARAGE on JERKSQUARE.\"",
    "smileDegree": 0.9974045290320483
  },
  {
    "timestamp": "2023-12-21T17:05:29.529Z",
    "joke": "What do you call a starfish with a missing arm Patrick Stump",
    "smileDegree": 0.008153214731008785
  },
  {
    "timestamp": "2023-12-21T17:05:39.354Z",
    "joke": "An anti-semantic walks into a synagogue. The linguists in the group are offended and leave.",
    "smileDegree": 0.005853483269734629
  },
  {
    "timestamp": "2023-12-21T17:05:52.456Z",
    "joke": "My cat's staring at the wall again. Either she can see ghosts, or she's mulling over past social situations she wishes she'd handled better.",
    "smileDegree": 0.5128351095708383
  },
  {
    "timestamp": "2023-12-21T17:06:03.709Z",
    "joke": "How does Hitler like his orange juice? Freshly squeezed.",
    "smileDegree": 1
  },
  {
    "timestamp": "2023-12-21T17:06:13.045Z",
    "joke": "Have you found Jesus? No? Me neither. I think we lost him near the border. God, I hope he's ok. He had like all the cocaine with him.",
    "smileDegree": 0.6252568135262224
  },
  {
    "timestamp": "2023-12-21T17:06:20.223Z",
    "joke": "Q: What do you call blonde twins doing bubble gum commercials? A: Double-dumb.",
    "smileDegree": 0.02348223325778797
  },
  {
    "timestamp": "2023-12-21T17:06:32.516Z",
    "joke": "I told my neighbor with a cute daughter this joke today and it's killing him. Why does it take pirates so long to learn the alphabet? Because they spend years at 'C'",
    "smileDegree": 0.014225382273566458
  },
  {
    "timestamp": "2023-12-21T17:06:42.281Z",
    "joke": "I told my doctor I abused drugs last night. Doctor:how? me: I punched my bottle of vicodin",
    "smileDegree": 0.9417606354331209
  },
  {
    "timestamp": "2023-12-21T17:06:46.645Z",
    "joke": "A man walks into a bar... and asks for chicken tendies.",
    "smileDegree": 0.0030425615937065436
  },
  {
    "timestamp": "2023-12-21T17:06:57.380Z",
    "joke": "How did the constipated mathematician solve his problem? With a pencil...",
    "smileDegree": 0.005632370929167032
  },
  {
    "timestamp": "2023-12-21T17:07:05.553Z",
    "joke": "English joke - What's another name for Santa's elves? Subordinate Clauses",
    "smileDegree": 0.0016422088481581319
  },
  {
    "timestamp": "2023-12-21T17:07:19.802Z",
    "joke": "Why did the dog sleep so poorly? By mistake he plugged his electric blanket into the toaster and kept popping out of bed all night!",
    "smileDegree": 0.020231477566887136
  },
  {
    "timestamp": "2023-12-21T17:07:32.639Z",
    "joke": "If an object falls at 500ft/s how far must Mohammed run to escape the blast?",
    "smileDegree": 1
  },
  {
    "timestamp": "2023-12-21T17:07:45.198Z",
    "joke": "Put the punchline before the setup. What's the best way to ruin any joke?",
    "smileDegree": 1
  },
  {
    "timestamp": "2023-12-21T17:08:06.861Z",
    "joke": "A man purchases a kitten, which he's having trouble house breaking. What does his friend say when he comes to visit? Your house is quite the cat-ass-trophy.",
    "smileDegree": 1
  },
  {
    "timestamp": "2023-12-21T17:08:15.015Z",
    "joke": "Why did the chicken cross the road? Don't know To get to the idiots house. Knock knock. Who's there? The chicken",
    "smileDegree": 0.006886267699695459
  },
  {
    "timestamp": "2023-12-21T17:08:21.958Z",
    "joke": "I would like to be Santa Claus He knows where all the naughty girls live.",
    "smileDegree": 0.0035593939600634785
  }
]