[
  {
    "timestamp": "2023-12-22T08:05:59.669Z",
    "joke": "A guy walks into a bar \"Ow,\" he says.",
    "smileDegree": 1
  },
  {
    "timestamp": "2023-12-22T08:06:11.178Z",
    "joke": "whats the differns between a blonde and a computer you only have to punch the computer once to get the imformation out of it",
    "smileDegree": 1
  },
  {
    "timestamp": "2023-12-22T08:06:33.477Z",
    "joke": "My friend asked me to take a look at something on r/jokes I replied, \"No thanks, I already reddit.\"",
    "smileDegree": 1
  },
  {
    "timestamp": "2023-12-22T08:06:45.466Z",
    "joke": "What do you call a sarcastic Canadian cow? Cowlin Mockery",
    "smileDegree": 0.08613361200726609
  },
  {
    "timestamp": "2023-12-22T08:07:00.092Z",
    "joke": "30 seconds staring confused at the calculator app before realizing why my phone wasn't calling the number I dialed.",
    "smileDegree": 1
  },
  {
    "timestamp": "2023-12-22T08:07:17.287Z",
    "joke": "It's fun to park next to that car that's parked far away so that no one will park next to it.",
    "smileDegree": 1
  },
  {
    "timestamp": "2023-12-22T08:07:27.477Z",
    "joke": "Two retirees meet in a cafe. The first retiree says, \"Hey Stan! I didn't see you at the doctor's yesterday. Are you sick?\"",
    "smileDegree": 0.7773956183237173
  },
  {
    "timestamp": "2023-12-22T08:07:35.140Z",
    "joke": "I don't have shit to say and",
    "smileDegree": 1
  },
  {
    "timestamp": "2023-12-22T08:07:51.187Z",
    "joke": "The worlds best chat-up line: \"I like my women how I like my coffee... Either cheap and bitter or ground up and in the freezer.\"",
    "smileDegree": 1
  },
  {
    "timestamp": "2023-12-22T08:08:17.053Z",
    "joke": "Do you know where my mexican hat is? - It's somewhere bro.. Fine...a sombrero, but what I'm asking is have you seen it?",
    "smileDegree": 0.003583156569341348
  },
  {
    "timestamp": "2023-12-22T08:08:27.132Z",
    "joke": "There was an awful fight at the seafood restaurant. Four fish got battered!",
    "smileDegree": 0.6255490959805441
  },
  {
    "timestamp": "2023-12-22T08:08:35.693Z",
    "joke": "My cat refuses to approach strangers. He's such a pussy.",
    "smileDegree": 1
  },
  {
    "timestamp": "2023-12-22T08:08:49.354Z",
    "joke": "You know it's a crazy party when the toilets smell less of puke than the dancefloor.",
    "smileDegree": 1
  },
  {
    "timestamp": "2023-12-22T08:09:11.558Z",
    "joke": "My teacher actually said this to us before out computing exam... Pupil: \"Will we be able to use the calculator in the exam?\" Sir: \"No, it will be disabled just like you\" No joke, he actually said that",
    "smileDegree": 1
  },
  {
    "timestamp": "2023-12-22T08:09:21.665Z",
    "joke": "What is a heroin addict's favorite website? Instagram.",
    "smileDegree": 0.7121222554686959
  },
  {
    "timestamp": "2023-12-22T08:09:33.876Z",
    "joke": "Why is Jesus' body bread? Because given enough time it rises",
    "smileDegree": 0.4081487495460713
  },
  {
    "timestamp": "2023-12-22T08:09:44.562Z",
    "joke": "Dogs are probably really excited about dog sledding before they find out what it actually is.",
    "smileDegree": 0.5473116239765546
  },
  {
    "timestamp": "2023-12-22T08:09:56.435Z",
    "joke": "Q: Why do blondes put rulers on their foreheads? A: They want to measure their intelligence.",
    "smileDegree": 0.8959024525913106
  },
  {
    "timestamp": "2023-12-22T08:10:07.918Z",
    "joke": "Two fish are in a tank. One turns to the other and says How do you drive this thing",
    "smileDegree": 1
  }
]