[
  {
    "timestamp": "2023-12-19T12:49:34.095Z",
    "joke": "Two fish are in a tank... One is driving, and the other is manning the guns.",
    "smileDegree": 1
  },
  {
    "timestamp": "2023-12-19T12:49:42.943Z",
    "joke": "Q: How do you know if a blonde has been sending e-mail? A: You see a bunch of envelopes stuffed into the disk drive.",
    "smileDegree": 0.9172763721464143
  },
  {
    "timestamp": "2023-12-19T12:49:52.265Z",
    "joke": "chicken. knock knock Why did the chicken cross the road? (To get to the idiots house.) *knock knock* \"Who's there?\" The chicken....",
    "smileDegree": 0.9534451211850399
  },
  {
    "timestamp": "2023-12-19T12:49:59.875Z",
    "joke": "Q: What can you do to help ease a heavy  traffic problem? A: Carry loaded weapons.",
    "smileDegree": 1
  },
  {
    "timestamp": "2023-12-19T12:50:07.693Z",
    "joke": "Why did Blackbeard cross the road? To indicate where the treasure is buried.",
    "smileDegree": 1
  },
  {
    "timestamp": "2023-12-19T12:50:27.407Z",
    "joke": "What do you call four Mexicans in quicksand? Quatro cinqo. EDIT: Yeah, I take French, not Spanish. :)",
    "smileDegree": 1
  },
  {
    "timestamp": "2023-12-19T12:50:35.232Z",
    "joke": "What is the most important use for cowhide?  To hold the cow together.",
    "smileDegree": 1
  },
  {
    "timestamp": "2023-12-19T12:50:45.540Z",
    "joke": "A man using Apple maps walks into a bar... Or maybe it was a hospital? Or possibly a church?",
    "smileDegree": 1
  },
  {
    "timestamp": "2023-12-19T12:50:55.467Z",
    "joke": "Why did the grinch cross the road? HE HAS TOO MUCH LONGER LEG !!!!",
    "smileDegree": 1
  },
  {
    "timestamp": "2023-12-19T12:51:05.459Z",
    "joke": "Coffee- LET'S DO THIS SHIT Weed- Don't be ridiculous",
    "smileDegree": 0.9416321519985813
  },
  {
    "timestamp": "2023-12-19T12:51:14.679Z",
    "joke": "FREEBIRD! (When you purchase a bird of equal or lesser value.)",
    "smileDegree": 1
  },
  {
    "timestamp": "2023-12-19T12:51:18.837Z",
    "joke": "Which gospel contains Jesus' parable about the shades of numbers? Math hue.",
    "smileDegree": 1
  },
  {
    "timestamp": "2023-12-19T12:51:33.214Z",
    "joke": "When Chinese audiences see movies based on toys... ...they probably think \"Hey look! It's those toys we made!\"",
    "smileDegree": 1
  },
  {
    "timestamp": "2023-12-19T12:51:40.353Z",
    "joke": "What's the difference between an angler and a  dunce? One baits his hooks while the other hates his books.",
    "smileDegree": 1
  },
  {
    "timestamp": "2023-12-19T12:51:48.876Z",
    "joke": "Teens are leaving FB for Twitter & Instagram to escape parents. Silly rabbits, we were here first.",
    "smileDegree": 1
  },
  {
    "timestamp": "2023-12-19T12:51:54.814Z",
    "joke": "Why are chickens racist? They are all in the Coop Clucks Clan",
    "smileDegree": 1
  },
  {
    "timestamp": "2023-12-19T12:52:03.994Z",
    "joke": "The saddest joke I've heard My wife ran off with my best friend... Now, when I throw the stick, it just lays there.",
    "smileDegree": 0.9682546493735005
  },
  {
    "timestamp": "2023-12-19T12:52:19.951Z",
    "joke": "There was an old woman walking her dog A man came up to her and said that's an ugly pig. The woman replied \"Sir, that's not a pig.\" The man said \"I was talking to the dog!\"",
    "smileDegree": 1
  },
  {
    "timestamp": "2023-12-19T12:52:28.241Z",
    "joke": "Why does Jesus eat at Benihana? Because he loves miso!",
    "smileDegree": 1
  },
  {
    "timestamp": "2023-12-19T12:52:35.976Z",
    "joke": "Why did the cat stop singing? Because it was out of tuna.",
    "smileDegree": 1
  },
  {
    "timestamp": "2023-12-19T12:52:43.267Z",
    "joke": "What kind of online videos do fish love to watch? Hardcore prawn",
    "smileDegree": 1
  },
  {
    "timestamp": "2023-12-19T12:52:51.051Z",
    "joke": "What did the fish say when he ran into a wall? \"DAM!\"",
    "smileDegree": 1
  },
  {
    "timestamp": "2023-12-19T12:52:58.579Z",
    "joke": "Admit it, you should be doing something else really important right now but you're on Facebook instead.",
    "smileDegree": 1
  },
  {
    "timestamp": "2023-12-19T12:53:03.255Z",
    "joke": "Do you know that awesome feeling after understating math? Me neither",
    "smileDegree": 1
  },
  {
    "timestamp": "2023-12-19T12:53:13.426Z",
    "joke": "bicycle cop: im taking you to jail me [sarcastic voice]: should i ride on your pegs or walk next to you [segway cop just dying laughing]",
    "smileDegree": 1
  },
  {
    "timestamp": "2023-12-19T12:53:28.926Z",
    "joke": "Everybody's talking about the super obnoxious drunk guy at the bar last night. I was at that same bar and I didn't even notice him. Weird.",
    "smileDegree": 1
  },
  {
    "timestamp": "2023-12-19T12:53:35.602Z",
    "joke": "Why did the blonde have blisters on her lips? From trying to blow out lightbulbs.",
    "smileDegree": 1
  },
  {
    "timestamp": "2023-12-19T12:53:42.336Z",
    "joke": "Sorry, there's a technical problem preventing me from RTing your tweets. Technically they're not funny.",
    "smileDegree": 1
  },
  {
    "timestamp": "2023-12-19T12:53:49.169Z",
    "joke": "Did you hear about the Mexican hit-man who was a chronic masturbator? He got excited when he was ordered to rub Juan out.",
    "smileDegree": 1
  },
  {
    "timestamp": "2023-12-19T12:53:58.379Z",
    "joke": "Who are you going to trust, some real doctor who says it's impossible to make you a centaur, or me, the guy with a hacksaw and half a horse?",
    "smileDegree": 1
  },
  {
    "timestamp": "2023-12-19T12:54:07.223Z",
    "joke": "GOOD COP: Tell us what you know BAD COP: Or we'll turn up the heat DAD COP: DON'T YOU TOUCH THAT DAMN THERMOSTAT",
    "smileDegree": 1
  },
  {
    "timestamp": "2023-12-19T12:54:16.939Z",
    "joke": "Two fish are in a tank... Two fish are in a tank... First one says: I'll drive! Second one says: \"I'll man the guns!\"",
    "smileDegree": 1
  },
  {
    "timestamp": "2023-12-19T12:54:24.020Z",
    "joke": "\"Cool calculator watch dude.\" ~nobody since 1987.",
    "smileDegree": 1
  },
  {
    "timestamp": "2023-12-19T12:54:28.570Z",
    "joke": "Cooking with Hitler Step 1. Turn on the gas",
    "smileDegree": 1
  }
]